# Пример готовой структуры:
#
# [
#
# (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
# (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
# (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
#
# Необходимо собрать аналитику о товарах. Реализовать словарь, в котором каждый ключ — характеристика товара,
# например название, а значение — список значений-характеристик, например список названий товаров.
#
# Пример:
#
# {
#
# “название”: [“компьютер”, “принтер”, “сканер”],
# “цена”: [20000, 6000, 2000],
# “количество”: [5, 2, 7],
# “ед”: [“шт.”]
# }
werehouse = []
scroll = int(input('Введите количество товаров: '))
for i in range(scroll):
    name = input('Введите название товара: ')
    price = int(input('Введите цену товара: '))
    count = int(input('Введите количество товара: '))
    product = [i + 1, {
        'название': name,
        'цена': price,
        'количество': count,
        'eд': 'шт.'
    }]
    werehouse.append(tuple(product))
print('Готовая структура: ', werehouse)

products = {}
for i in range(len(werehouse)):
    products.setdefault('название', []).append(werehouse[i][1]['название'])
    products.setdefault('цена', []).append(werehouse[i][1]['цена'])
    products.setdefault('количество', []).append(werehouse[i][1]['количество'])
    products['eд'] = ['шт.']

print('Аналитика о товарах, собранная в словаре: ', products)




