# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать
# функцию type() для проверки типа. Элементы списка можно не запрашивать
# у пользователя, а указать явно,
# в программе.
a = 10
b = 10 > 5
list_1 =['стол', a, b]

print(type(list_1[0]))
print(type(list_1[1]))
print(type(list_1[2]))
